html-content/lectures.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-02-20 Thu 09:47 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>400A - Lectures topic-by-topic</title>
<meta name="author" content="Mathieu Renzo" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./css/style.css" />
<link rel="stylesheet" href="./fontawesome-free-6.7.2-web/css/all.min.css">
<meta name="keywords" content="Mathieu, Renzo, Mathieu Renzo,
			       stellar evolution, 400A, University of
			       Arizona, Steward Observatory, stars,
			       theoretical astrophysics">
</head>
<body>
<div id="preamble" class="status">
<!-- Preamble -->
<!-- The header -->
<div class="header">

  <!-- The site name -->
  <div class="site-name">
    <a id="top" href="./index.html">Stellar Evolution</a>
  </div>

  <!-- The hamburger -->
  <div class="hamburger">
    <div id="myLinks" class="menu">
      <a href="./index.html">Home</a>
      <a href="./syllabus.html">Syllabus</a>
      <a href="./lectures.html">Lectures</a>
      <a href="./projects.html">Projects</a>
    </div>
    <a  href="javascript:void(0);" class="icon" onclick="HamburgerMenuFunction()">
      <i class="fa fa-bars"></i>
    </a>
  </div>

  <div class="navbar">
    <a href="./syllabus.html">Syllabus</a>
    <a href="./lectures.html">Lectures</a>
    <a href="./projects.html">Projects</a>
  </div>
</div>

<!-- scripts -->
<script>
  function HamburgerMenuFunction() {
      var x = document.getElementById("myLinks");
      if (x.style.display === "block") {
	  x.style.display = "none";
      } else {
	  x.style.display = "block";
      }
  }
</script>

<script>
  window.onload = () => {
      const toggleButton = document.getElementById("light-dark-toggle");
      const body = document.body;
      const html = document.documentElement;


      // Check localStorage for user preference
      if (localStorage.getItem("theme") === "dark") {
          body.classList.add("dark-mode");
	  html.classList.toggle("dark-mode");
      }

      // Toggle theme on click
      toggleButton.addEventListener("click", () => {
          body.classList.toggle("dark-mode");
	  html.classList.toggle("dark-mode");

          // Save user preference
          if (body.classList.contains("dark-mode")) {
              localStorage.setItem("theme", "dark");
          } else {
              localStorage.setItem("theme", "light");
          }
      });
  };
</script>
<!-- end scripts-->
</div>
<div id="content" class="content">

<div id="outline-container-org553ac76" class="outline-2">
<h2 id="org553ac76"><a href="#org553ac76">Lectures topic-by-topic</a></h2>
<div class="outline-text-2" id="text-org553ac76">
<p>
This is a rough schedule of the topics we will cover. However, we may
not get to all topics, depending on progress throughout the semester
and student interests. The order roughly follows the presentation in
<a href="https://www.astro.ru.nl/~onnop/">Prof. Onno Pols' notes</a>, but it is subject to changes as the course progresses.
</p>

<p>
<b>N.B.:</b> The notes provided here are intended to complement, <i>not</i>
substitute other sources. You are <b>strongly encouraged</b> to consult books
(e.g., Kippenhahn et al. 2012) and Prof. Onno Pols' notes.
</p>
</div>

<div id="outline-container-orgac18852" class="outline-3">
<h3 id="orgac18852"><a href="#orgac18852"><span class="timestamp-wrapper"><span class="timestamp">2025-01-16 Thu </span></span> - Intro &amp; orders of magnitude</a></h3>
<div class="outline-text-3" id="text-orgac18852">
<p>
<b>Aim</b>:
</p>
<ul class="org-ul">
<li>Discuss <a href="./syllabus.html">syllabus</a> and learning outcomes</li>
<li>Go over some basics (magnitudes, parallaxes, solar quantities: M<sub>☉</sub>, R<sub>☉</sub>, L<sub>☉</sub>, stellar lifetimes)</li>
<li>Discuss project, show list</li>
<li>Discuss expectations and grading rubrics for course and project</li>
</ul>

<p>
<a href="./notes-lecture-Intro.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-org2e6803b" class="outline-3">
<h3 id="org2e6803b"><a href="#org2e6803b"><span class="timestamp-wrapper"><span class="timestamp">2025-01-21 Tue </span></span> - Color-magnitude and Hertzsprung-Russell diagram</a></h3>
<div class="outline-text-3" id="text-org2e6803b">
<p>
<b>Aim</b>: Introduce color-magnitude diagrams, theoretical HR diagram, and
how they relate to each other. Review some black body radiation and
the basics of spectral formation to introduce spectral types.
</p>

<p>
<a href="./notes-lecture-CMD-HRD.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-org4fe1b97" class="outline-3">
<h3 id="org4fe1b97"><a href="#org4fe1b97"><span class="timestamp-wrapper"><span class="timestamp">2025-01-23 Thu </span></span> - Binaries and mass measurements</a></h3>
<div class="outline-text-3" id="text-org4fe1b97">
<p>
<b>Aim</b>: Introduce the concept of binarity of stars as something <i>not</i>
exotic. Walk through some classes of binaries based on how we observe
them (astrometric, visual, spectroscopic, eclipsing) and how they can
be used for empirical mass determination.
</p>

<p>
<a href="./notes-lecture-BIN.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-orgf3b7280" class="outline-3">
<h3 id="orgf3b7280"><a href="#orgf3b7280"><span class="timestamp-wrapper"><span class="timestamp">2025-01-28 Tue </span></span> - Hydrostatic equilibrium</a></h3>
<div class="outline-text-3" id="text-orgf3b7280">
<p>
<b>Aim</b>: Introduce the mass conservation and hydrostatic equilibrium
equations of stellar evolution. Re-discuss the assumption of spherical
symmetry. Introduce the dynamical timescale(s). Brief introduction to
<a href="http://user.astro.wisc.edu/~townsend/static.php?ref=mesa-web-submit">MESA-web</a>.
</p>

<p>
<a href="./notes-lecture-HSE.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-orgac09210" class="outline-3">
<h3 id="orgac09210"><a href="#orgac09210"><span class="timestamp-wrapper"><span class="timestamp">2025-01-30 Thu </span></span> - Equation of state 1</a></h3>
<div class="outline-text-3" id="text-orgac09210">
<p>
<b>Aim</b>: Introduce Polytropic and ideal gas equation of state.
</p>

<p>
<a href="./notes-lecture-EOS1.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-orgdfe97fe" class="outline-3">
<h3 id="orgdfe97fe"><a href="#orgdfe97fe"><span class="timestamp-wrapper"><span class="timestamp">2025-02-04 Tue </span></span> - Virial theorem</a></h3>
<div class="outline-text-3" id="text-orgdfe97fe">
<p>
<b>Aim</b>: Introduce the Virial theorem in various forms. Demonstrate that
stars "become hotter as they lose energy".
</p>

<p>
<a href="./notes-lecture-VirTheo.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-org1902bf3" class="outline-3">
<h3 id="org1902bf3"><a href="#org1902bf3"><span class="timestamp-wrapper"><span class="timestamp">2025-02-06 Thu </span></span> - Equation of state 2</a></h3>
<div class="outline-text-3" id="text-org1902bf3">
<p>
<b>Aim</b>: Introduce other relevant equations of state
</p>
<ul class="org-ul">
<li>Degenerate and non-relativistic gas</li>
<li>Degenerate and relativistic gas</li>
<li>Radiation-dominated EOS</li>
</ul>

<p>
<a href="./notes-lecture-EOS2.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-org0fa3227" class="outline-3">
<h3 id="org0fa3227"><a href="#org0fa3227"><span class="timestamp-wrapper"><span class="timestamp">2025-02-11 Tue </span></span> - Radiative energy transport &amp; conduction</a></h3>
<div class="outline-text-3" id="text-org0fa3227">
<p>
<b>Aim</b>: Energy transport in radiative layers, the third stellar structure
equation for non-polytropic models, and local energy conservation
</p>

<p>
<a href="./notes-lecture-ETransport.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-org88d07a3" class="outline-3">
<h3 id="org88d07a3"><a href="#org88d07a3"><span class="timestamp-wrapper"><span class="timestamp">2025-02-13 Thu </span></span> - Opacities</a></h3>
<div class="outline-text-3" id="text-org88d07a3">
<p>
<b>Aim</b>: discuss opacity, Rosseland mean opacities, atomic physics and other
sources of opacity in a star
</p>

<p>
<a href="./notes-lecture-kappa.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-orgf0dcb9e" class="outline-3">
<h3 id="orgf0dcb9e"><a href="#orgf0dcb9e"><span class="timestamp-wrapper"><span class="timestamp">2025-02-18 Tue </span></span> - Convection</a></h3>
<div class="outline-text-3" id="text-orgf0dcb9e">
<p>
<b>Aim</b>: Introduce convective instability, mixing length theory, and its
limitations
</p>

<p>
<a href="./notes-lecture-convection.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-orgcb6bf42" class="outline-3">
<h3 id="orgcb6bf42"><a href="#orgcb6bf42"><span class="timestamp-wrapper"><span class="timestamp">2025-02-20 Thu </span></span> - Nuclear energy generation</a></h3>
<div class="outline-text-3" id="text-orgcb6bf42">
<p>
<b>Aim</b>: Introduce basics of nuclear energy generation through fusion,
recall basic quantum mechanics elements, Gamow peak
</p>

<p>
<a href="./notes-lecture-nuclear-burning.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-org5c8fc72" class="outline-3">
<h3 id="org5c8fc72"><a href="#org5c8fc72"><span class="timestamp-wrapper"><span class="timestamp">2025-02-25 Tue </span></span> - Nuclear reaction chains</a></h3>
<div class="outline-text-3" id="text-org5c8fc72">
<p>
<b>Aim</b>: Introduce pp chain, CN-NO bi-cycle, 3&alpha; burning, and later burning
phases.
</p>

<p>
<a href="./notes-lecture-nuclear-cycles.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-orgefe40c5" class="outline-3">
<h3 id="orgefe40c5"><a href="#orgefe40c5"><span class="timestamp-wrapper"><span class="timestamp">2025-02-27 Thu </span></span> - Neutrino cooling + stellar evolution codes</a></h3>
<div class="outline-text-3" id="text-orgefe40c5">
<p>
<b>Aim</b>: discuss neutrino physics relevant to stars, cooling processes and
thus complete the physics needed for 1D stellar evolution calculation.
Introduce general principles of stellar structure and evolution codes
and population synthesis.
</p>

<p>
<a href="./notes-lecture-neutrinos.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-org3a44d2a" class="outline-3">
<h3 id="org3a44d2a"><a href="#org3a44d2a"><span class="timestamp-wrapper"><span class="timestamp">2025-03-04 Tue </span></span> - Stellar atmospheres and outer boundary conditions</a></h3>
<div class="outline-text-3" id="text-org3a44d2a">
<p>
<b>Aims</b>: discuss in more detail the following:
</p>
<ul class="org-ul">
<li>outer boundary conditions</li>
<li>Saha equation</li>
<li>line formation region</li>
<li>line broadening mechanisms</li>
</ul>

<p>
<a href="./notes-lecture-radTrans.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-orgc883024" class="outline-3">
<h3 id="orgc883024"><a href="#orgc883024"><span class="timestamp-wrapper"><span class="timestamp">2025-03-06 Thu </span></span> - <b>Guest lecture</b>: Neutrinos in stars</a></h3>
<div class="outline-text-3" id="text-orgc883024">
<p>
Guest lecturer: <a href="https://sites.google.com/view/aldanagrichener">Dr. Aldana Grichener</a>
</p>

<ul class="org-ul">
<li><a href="./images/GuestLectureAldanaGrichenerNeutrinosNotesForStudents.pdf">Notes</a></li>
<li><a href="./images/SlidesNeutrinosAldanaGrichener.pdf">Slides</a></li>
</ul>
</div>
</div>

<div id="outline-container-org53133d8" class="outline-3">
<h3 id="org53133d8"><a href="#org53133d8"><span class="timestamp-wrapper"><span class="timestamp">2025-03-10 Mon </span></span> - <span class="timestamp-wrapper"><span class="timestamp">2025-03-14 Fri </span></span> - SPRING BREAK</a></h3>
</div>
<div id="outline-container-orga4200e9" class="outline-3">
<h3 id="orga4200e9"><a href="#orga4200e9"><span class="todo TODO">TODO</span> <span class="timestamp-wrapper"><span class="timestamp">2025-03-18 Tue </span></span> - <b>Guest Lecture TBD</b></a></h3>
<div class="outline-text-3" id="text-orga4200e9">
<p>
Guest Lecturer: <a href="https://koushiksen1995.github.io/">Dr. Koushik Sen</a>
</p>
</div>
</div>
<div id="outline-container-org1ef1b1c" class="outline-3">
<h3 id="org1ef1b1c"><a href="#org1ef1b1c"><span class="timestamp-wrapper"><span class="timestamp">2025-03-20 Thu </span></span> - <b>Special Guest Lecture</b>: Asteroseismology</a></h3>
<div class="outline-text-3" id="text-org1ef1b1c">
<p>
Guest Lecturer: <a href="https://fys.kuleuven.be/ster/staff/conny-aerts">Prof. Conny Aerts</a> from KU Leuven
</p>

<ul class="org-ul">
<li><a href="https://www.aanda.org/articles/aa/full_html/2024/12/aa48575-23/aa48575-23.html">Recent review article</a></li>
</ul>

<p>
Participation from Steward Observatory and NOIR lab will be encouraged
</p>
</div>
</div>

<div id="outline-container-org627b6fe" class="outline-3">
<h3 id="org627b6fe"><a href="#org627b6fe"><span class="timestamp-wrapper"><span class="timestamp">2025-03-25 Tue </span></span> - In class activity: Evolution 1</a></h3>
<div class="outline-text-3" id="text-org627b6fe">
<p>
<b>Aim</b>: discuss the evolution of stars in an in-class activity based on
<code>MESA-web</code> models precomputed by the students
</p>

<p>
<a href="./notes-in-class-evol.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-org51db108" class="outline-3">
<h3 id="org51db108"><a href="#org51db108"><span class="timestamp-wrapper"><span class="timestamp">2025-03-27 Thu </span></span> - In class activity: Evolution 2</a></h3>
<div class="outline-text-3" id="text-org51db108">
<p>
<b>Aim</b>: discuss the evolution of stars in an in-class activity based on
<code>MESA-web</code> models precomputed by the students
</p>

<p>
<a href="./notes-in-class-evol.html">Notes</a>
</p>
</div>
</div>
<div id="outline-container-orgd65bf56" class="outline-3">
<h3 id="orgd65bf56"><a href="#orgd65bf56"><span class="timestamp-wrapper"><span class="timestamp">2025-04-01 Tue </span></span> - In class activity: Evolution 2</a></h3>
<div class="outline-text-3" id="text-orgd65bf56">
<p>
<b>Aim</b>: discuss the evolution of stars in an in-class activity based on
<code>MESA-web</code> models precomputed by the students
</p>

<p>
<a href="./notes-in-class-evol.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-orgdc206fe" class="outline-3">
<h3 id="orgdc206fe"><a href="#orgdc206fe"><span class="timestamp-wrapper"><span class="timestamp">2025-04-03 Thu </span></span> - In class activity: Evolution 3</a></h3>
<div class="outline-text-3" id="text-orgdc206fe">
<p>
<b>Aim</b>: discuss the evolution of stars in an in-class activity based on
<code>MESA-web</code> models precomputed by the students
</p>

<p>
<a href="./notes-in-class-evol.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-orgdc0cbcf" class="outline-3">
<h3 id="orgdc0cbcf"><a href="#orgdc0cbcf"><span class="todo TODO">TODO</span> <span class="timestamp-wrapper"><span class="timestamp">2025-04-01 Tue </span></span> - In class activity: Evolution 4</a></h3>
</div>
<div id="outline-container-org2b7f023" class="outline-3">
<h3 id="org2b7f023"><a href="#org2b7f023"><span class="todo TODO">TODO</span> <span class="timestamp-wrapper"><span class="timestamp">2025-04-03 Thu </span></span> - In class activity: Evolution 5</a></h3>
</div>
<div id="outline-container-org99348a1" class="outline-3">
<h3 id="org99348a1"><a href="#org99348a1"><span class="timestamp-wrapper"><span class="timestamp">2025-04-08 Tue </span></span> - Mass transfer stability, Roche lobe overflow and common envelope</a></h3>
<div class="outline-text-3" id="text-org99348a1">
<p>
<b>Aim</b>: introduce binary mass transfer
<a href="./notes-lecture-RLOF.html">Notes</a>
</p>
</div>
</div>
<div id="outline-container-orgc068adb" class="outline-3">
<h3 id="orgc068adb"><a href="#orgc068adb"><span class="timestamp-wrapper"><span class="timestamp">2025-04-15 Tue </span></span> - Supernovae</a></h3>
<div class="outline-text-3" id="text-orgc068adb">
<p>
<b>Aim</b>: Introduce the nomenclature for supernovae, discuss the physics of
core-collapse and the formation of compact objects
</p>

<p>
<a href="./notes-lecture-SNe.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-org7d0641a" class="outline-3">
<h3 id="org7d0641a"><a href="#org7d0641a"><span class="todo TODO">TODO</span> <span class="timestamp-wrapper"><span class="timestamp">2025-04-10 Thu </span></span> - Gravitational wave progenitors</a></h3>
<div class="outline-text-3" id="text-org7d0641a">
<p>
<b>Aim</b>: introduce gravitational wave formation scenario (isolated binary
and dynamical assembly), discuss some known uncertainties.
</p>

<p>
<a href="./notes-lecture-GWprog.html">Notes</a>
</p>
</div>
</div>

<div id="outline-container-org3788c2b" class="outline-3">
<h3 id="org3788c2b"><a href="#org3788c2b"><span class="timestamp-wrapper"><span class="timestamp">2025-04-17 Thu </span></span> - Two student presentations</a></h3>
<div class="outline-text-3" id="text-org3788c2b">
<p>
<b>Aim</b>: students will present a topic in stellar evolution to the class.
The details of the schedule will be communicated on D2L
</p>
</div>
</div>

<div id="outline-container-org0c35962" class="outline-3">
<h3 id="org0c35962"><a href="#org0c35962"><span class="timestamp-wrapper"><span class="timestamp">2025-04-22 Tue </span></span> - Two student presentations</a></h3>
<div class="outline-text-3" id="text-org0c35962">
<p>
<b>Aim</b>: students will present a topic in stellar evolution to the class.
The details of the schedule will be communicated on D2L
</p>
</div>
</div>

<div id="outline-container-orgb57917f" class="outline-3">
<h3 id="orgb57917f"><a href="#orgb57917f"><span class="timestamp-wrapper"><span class="timestamp">2025-04-24 Thu </span></span> - Two student presentations</a></h3>
<div class="outline-text-3" id="text-orgb57917f">
<p>
<b>Aim</b>: students will present a topic in stellar evolution to the class.
The details of the schedule will be communicated on D2L
</p>
</div>
</div>

<div id="outline-container-org0d7d207" class="outline-3">
<h3 id="org0d7d207"><a href="#org0d7d207"><span class="timestamp-wrapper"><span class="timestamp">2025-04-29 Tue </span></span> - Two student presentations</a></h3>
<div class="outline-text-3" id="text-org0d7d207">
<p>
<b>Aim</b>: students will present a topic in stellar evolution to the class.
The details of the schedule will be communicated on D2L
</p>
</div>
</div>

<div id="outline-container-org0f08778" class="outline-3">
<h3 id="org0f08778"><a href="#org0f08778"><span class="timestamp-wrapper"><span class="timestamp">2025-05-01 Thu </span></span> - Two student presentations</a></h3>
<div class="outline-text-3" id="text-org0f08778">
<p>
<b>Aim</b>: students will present a topic in stellar evolution to the class.
The details of the schedule will be communicated on D2L
</p>
</div>
</div>

<div id="outline-container-org2997cf4" class="outline-3">
<h3 id="org2997cf4"><a href="#org2997cf4"><span class="timestamp-wrapper"><span class="timestamp">2025-05-06 Tue </span></span> - One student presentations</a></h3>
<div class="outline-text-3" id="text-org2997cf4">
<p>
Extra time can be used as backup
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">
  <hr>
  <a href="#light-dark-toggle"><i id="light-dark-toggle"><i class="fa-solid fa-circle-half-stroke"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="syllabus.html"><i class="fa-solid fa-arrow-left" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="#top"><i class="fa-solid fa-arrow-up" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="notes-lecture-Intro.html"><i class="fa-solid fa-arrow-right" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="https://github.com/mathren/stellar_phys_400A"><i class="fa-brands fa-github" style="font-size:16px"></i></a><hr>
  <br>
  Last updated on 20 February 2025 <br>
  Made with Emacs 28.1 - Org mode 9.5.2
  <br>
</div>
</div>
</body>
</html>
